W7D4-new_user_view/sizzler_new_user_view/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-02-11 01:57:08.120556"], ["session_token", "pLfXuJEjZcwFNTZpcy_SxQ"], ["id", 6]]