W7D4-new_user_view/sizzler_new_user_view/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "country", "age", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
        @user = User.find(params[:id])
        if user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "country" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["country", "North Korea"], ["updated_at", "2022-02-04 01:54:00.648616"], ["id", 6]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)