W6D3-routes-controllers/sizzler/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "email", "country", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "china_number_1"], ["email", "jonathan@mail.com"], ["country", "South Africa"], ["age", 12], ["created_at", "2022-02-03 02:00:11.977356"], ["updated_at", "2022-02-03 02:00:11.977356"]]