W6D5-views/sizzler_user_index_show_partial/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "country", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "china_number_1"], ["email", "jonathan@mail.com"], ["country", "South Africa"], ["age", 12], ["created_at", "2022-02-03 02:00:11.977356"], ["updated_at", "2022-02-03 02:00:11.977356"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
        @user = User.find(params[:id])
        if user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "country" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["country", "North Korea"], ["updated_at", "2022-02-04 01:54:00.648616"], ["id", 6]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)